[
  {
    "name": "Abdul Halim",
    "avatar": "https://upload.wikimedia.org/wikipedia/commons/7/79/Abdul_Halim_Prime_Minister.jpg",
    "description": "dr. Abdul Halim (ejaan lama: Abdoel Halim) (lahir di Bukittinggi, Sumatra Barat, 27 Desember 1911 – meninggal di Jakarta, 4 Juli 1987 pada umur 75 tahun) adalah Perdana Menteri Indonesia pada Kabinet Halim (1949) yang memerintah ketika Republik Indonesia menjadi bagian Republik Indonesia Serikat.",
    "date_of_birth": "27 Desember 1911",
    "date_of_death": "4 Juli 1988"
  },
  {
    "name": "Abdul Halim Majalengka",
    "avatar": "https://upload.wikimedia.org/wikipedia/id/c/cd/K.H._Abdul_Halim.jpg",
    "description": "Abdul Halim atau K.H. Abdul Halim, lebih dikenal dengan nama K.H. Abdul Halim Majalengka (lahir di Desa Ciborelang, Jatiwangi, Majalengka, Kecamatan Jatiwangi, Majalengka, Kabupaten Majalengka, Jawa Barat, 26 Juni 1887 – meninggal di Majalengka, 7 Mei 1962 pada umur 74 tahun) adalah Pahlawan Nasional berdasarkan Keputusan Presiden Republik Indonesia, Susilo Bambang Yudoyono Nomor: 041/TK/Tahun 2008 tanggal 6 November 2008.[1]. Seorang tokoh pergerakan nasional, tokoh organisasi Islam, dan ulama yang terkenal toleran dalam menghadapi perbedaan pendapat antar ulama tradisional dan pembaharu (modernis).",
    "date_of_birth": "26 Juni 1887",
    "date_of_death": "7 Mei 1962"
  },
  {
    "name": "Abdul Haris Nasution",
    "avatar": "https://upload.wikimedia.org/wikipedia/commons/a/ac/Abdul_Harris_Nasution.jpg",
    "description": "Jenderal Besar TNI (Purn.) Dr. Abdul Haris Nasution (lahir di Kotanopan, Sumatra Utara, 3 Desember 1918 – meninggal di Jakarta, 6 September 2000 pada umur 81 tahun) adalah seorang pahlawan nasional Indonesia[2] yang merupakan salah satu tokoh TNI AD yang menjadi sasaran dalam peristiwa Gerakan 30 September. Selamat dari upaya penculikan tersebut namun Nasution harus kehilangan putrinya Ade Irma Suryani Nasution beserta ajudannya, Lettu Pierre Tendean. Nasution merupakan konseptor Dwifungsi ABRI yang disampaikan pada tahun 1958 yang kemudian diadopsi selama pemerintahan Soeharto. Konsep dasar yang ditawarkan tersebut merupakan jalan agar ABRI tidak harus berada di bawah kendali sipil, tetapi pada saat yang sama tidak boleh mendominasi sehingga menjadi sebuah kediktatoran militer. Bersama Soeharto dan Soedirman, Nasution menerima pangkat kehormatan Jenderal Besar yang dianugerahkan pada tanggal 5 Oktober 1997, saat ulang tahun ABRI.",
    "date_of_birth": "3 Desember 1918",
    "date_of_death": "5 September 2000 "
  },
  {
    "name": "Abdul Kadir",
    "avatar": "https://radarkapuas.id/wp-content/uploads/2019/11/BADUL-KADIR.jpg",
    "description": "Abdul Kadir Gelar Raden Temenggung Setia Pahlawan (lahir: Sintang, Kalimantan Barat, 1771 - wafat: Tanjung Suka Dua, Melawi, 1875) adalah seorang pahlawan nasional Indonesia dari Melawi. Pada tahun 1845, ia diangkat sebagai Kepala Pemerintahan Melawi yang merupakan bagian dari Kerajaan Sintang. Sebagai pejabat kerajaan ai mendapat gelar Raden temenggung. Ia berhasil mengembangkan potensi perekonomian wilayah ini dan mempersatukan suku Dayak dengan Melayu. Selain itu ia juga berjuang menentang Belanda yang ingin menguasai wilayah ini. Tahun 1999 diangkat sebagai Pahlawan Nasional melalui Surat Keputusan Presiden nomor 114 / TK / 1999 tanggal 13 - 10 - 1999.",
    "date_of_birth": "1771",
    "date_of_death": "1875"
  },
  {
    "name": "Abdul Kahar Mudzakkir",
    "avatar": "https://upload.wikimedia.org/wikipedia/commons/7/72/Abdul_Kahar_Mudzakkir.jpg",
    "description": "Prof. KH. Abdoel Kahar Moezakir atau ejaan baru Abdul Kahar Muzakir, (lahir di Gading, Playen, Gunung Kidul, Yogyakarta, 16 April 1907 – meninggal di Yogyakarta, 2 Desember 1973 pada umur 66 tahun) adalah Rektor Magnificus yang dipilih Universitas Islam Indonesia untuk pertama kali dengan nama STI selama 2 periode 1945—1948 dan 1948—1960. Ia adalah anggota BPUPKI (Badan Penyelidik Usaha-Usaha Persiapan Kemerdekaan Indonesia). Tokoh Islam yang pernah menjadi anggota Dokuritsu Junbi Chōsakai (Badan Penyelidik Usaha-Usaha Persiapan Kemerdekaan Indonesia) ini pula yang tetap dipertahankan ketika UII dihadirkan sebagai pengganti STI pada 4 Juni 1948. Ia menduduki jabatan sebagai Rektor UII sampai tahun 1960. Pada 2012, ia diusulkan untuk dianugerahi gelar pahlawan nasional. Pada tanggal 8 November 2019, Abdul Kahar Muzakir dianugerahi gelar Pahlawan Nasional oleh Presiden Joko Widodo dalam sebuah upacara di Istana Negara. Yang menerima penghargaan mewakili keluarga ahli waris adalah Siti Jauharoh, anak dari Abdul Kahar Muzakir.",
    "date_of_birth": "16 April 1907",
    "date_of_death": "2 Desember 1973"
  },
  {
    "name": "Abdul Malik Karim Amrullah",
    "avatar": "https://upload.wikimedia.org/wikipedia/commons/8/80/Abdul_Malik_Karim_Amrullah%2C_Pekan_Buku_Indonesia_1954%2C_p217.jpg",
    "description": "Prof. DR. H. Abdul Malik Karim Amrullah gelar Datuk Indomo, populer dengan nama penanya Hamka (bahasa Arab: عبد الملك كريم أمر الله‎; lahir di Nagari Sungai Batang, Tanjung Raya, Kabupaten Agam, Sumatra Barat, 17 Februari 1908 – meninggal di Jakarta, 24 Juli 1981 pada umur 73 tahun) adalah seorang ulama dan sastrawan Indonesia. Ia berkarier sebagai wartawan, penulis, dan pengajar. Ia terjun dalam politik melalui Masyumi sampai partai tersebut dibubarkan, menjabat Ketua Majelis Ulama Indonesia (MUI) pertama, dan aktif dalam Muhammadiyah hingga akhir hayatnya. Universitas al-Azhar dan Universitas Nasional Malaysia menganugerahkannya gelar doktor kehormatan, sementara Universitas Moestopo, Jakarta mengukuhkan Hamka sebagai guru besar. Namanya disematkan untuk Universitas Hamka milik Muhammadiyah dan masuk dalam daftar Pahlawan Nasional Indonesia.",
    "date_of_birth": "17 Februari 1908",
    "date_of_death": "24 Juli 1981"
  },
  {
    "name": "Abdul Muis",
    "avatar": "",
    "description": "",
    "date_of_birth": "1883",
    "date_of_death": "1959"
  },
  {
    "name": "Abdul Rahman Saleh",
    "avatar": "",
    "description": "",
    "date_of_birth": "1909",
    "date_of_death": "1947"
  },
  {
    "name": "Abdul Wahab Hasbullah",
    "avatar": "",
    "description": "",
    "date_of_birth": "1888",
    "date_of_death": "1971"
  },
  {
    "name": "Andi Abdullah Bau Massepe",
    "avatar": "",
    "description": "",
    "date_of_birth": "1918",
    "date_of_death": "1947"
  }
]
